# End Treatment Type Create(Document) Method

Source: https://www.revitapidocs.com/2026/1aa3160e-1ef5-273b-f480-f171f15fa555.htm

---

| End Treatment Type Create(Document) Method |
| --- |

Creates a new EndTreatmentType in the specified document.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static EndTreatmentType Create(
	Document doc
)
```

```
Public Shared Function Create (
	doc As Document
) As EndTreatmentType
```

```
public:
static EndTreatmentType^ Create(
	Document^ doc
)
```

```
static member Create :
        doc : Document -> EndTreatmentType
```

#### Parameters

doc Document
:   A Document.

#### Return Value

EndTreatmentType
Returns the newly created EndTreatmentType in the specified document. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

EndTreatmentType Class Create Overload Autodesk.Revit.DB.Structure Namespace